backend/app/controllers/press_releases_controller.rb

SELECT "press_releases".* FROM "press_releases"
---
  def index
  @press_releases = PressRelease.all

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "press_releases" ("title", "content", "created_at", "updated_at", "body", "user_id") VALUES ('テストタイトル', '本文', '2025-09-09 04:00:21.271783', '2025-09-09 04:00:21.271783', '本文', 1) RETURNING "id"
---
  def create
  @press_release = PressRelease.new(press_release_params)
  # 認証未実装の場合は仮ユーザーをセット
  @press_release.user = User.first
    if @press_release.save