backend/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)  # 受け取ったパラメータからユーザーを作成

    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ('テストユーザー', 'test@example.com', '2025-09-09 03:57:45.783656', '2025-09-09 03:57:45.783656') RETURNING "id"